# TransformWithBoundary Properties

---
The TransformWithBoundary type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
TransformWithBoundary Class
Autodesk.Revit.DB Namespace